package main
import "fmt"

/* 10. Дана последовательность температурных колебаний: -25.4, -27.0 13.0, 19.0, 15.5, 24.5, -21.0, 32.5. 
Объединить данные значения в группы с шагом в 10 градусов. 
Последовательность в подмножноствах не важна.
Пример: -20:{-25.0, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20: {24.5}, etc. */

func set(array []float64) map[int][]float64 {
	values := make(map[int][]float64)
	for _, i := range array {
		values[int(i / 10) * 10] = append(values[int(i / 10) * 10], i)
	}
	return values
}

func main() {
	arr := []float64{-25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5}
	fmt.Print(set(arr))
}